tap "hashicorp/tap"
tap "hashicorp/tap"
tap "homebrew/services"
tap "manaflow-ai/cmux"

brew "adr-tools"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "helm"
brew "jq"
brew "k9s"
brew "kubectx"
brew "node"
brew "pre-commit"
brew "prettier"
brew "protobuf"
brew "ripgrep"
brew "rtk"
brew "rust"
brew "stow"
brew "tflint"
brew "tilt"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "watch"
brew "yq"
brew "hashicorp/tap/terraform"

cask "1password"
cask "1password-cli"
cask "arc"
cask "bartender"
cask "cmux"
cask "firefox"
cask "ghostty"
cask "obsidian"
cask "rectangle"

go "golang.org/x/perf/cmd/benchstat"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

cargo "bob-nvim"

npm "@google/gemini-cli"

if ENV["WORK_MACHINE"]
    tap "datadog-labs/pack"
    tap "snyk/tap"

    brew "awscli"
    brew "snyk-cli"
    brew "datadog-labs/pack/pup"
    cask "gcloud-cli"
    cask "datagrip", args: { appdir: "/Applications" }
end
